# Importar Pandas

In [8]:
#importa pandas
import pandas as pd
import pyodbc as podbc

In [9]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\pc\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in c:\users\pc\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\pc\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\pc\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\users\pc\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

# Crear un Dataframe

In [10]:
# Crea un dataframe vacío llamado 'df'
Dic={}
df=pd.DataFrame(Dic)
df

Empty DataFrame
Columns: []
Index: []

In [20]:
# Crea una nueva columna en el dataframe, y asignale la primera serie que has creado
Dic={
    "Nombre":["Rosmery"],
    "Apellido":["Ventura Conislla"],
    "Edad":[23],
    "Talla":[1.53],
    "Peso k":[1.51]   
}

Call=pd.DataFrame(Dic)
Call

    Nombre          Apellido  Edad  Talla  Peso k
0  Rosmery  Ventura Conislla    23   1.53    1.51

In [21]:
# Crea otra columna en el dataframe y asignale la segunda Serie que has creado

Dic={
    "Nombre":["Rosmery","Maria"],
    "Apellido":["Ventura Conislla","Conislla Quispe"],
    "Edad":[23,43],
    "Talla":[1.53,1.54],
    "Peso k":[51,82,]   
}

Call=pd.DataFrame(Dic)
Call

    Nombre          Apellido  Edad  Talla  Peso k
0  Rosmery  Ventura Conislla    23   1.53      51
1    Maria   Conislla Quispe    43   1.54      82

# Leer un dataframe

In [45]:
# Lee el archivo llamado 'avengers.csv" localizado en la carpeta "data" y crea un DataFrame, llamado 'avengers'. 
# El archivo está localizado en "data/avengers.csv"

df = pd.read_csv('./data/avengers.csv')

# Inspeccionar un dataframe

In [46]:
# Muestra las primeras 5 filas del DataFrame.
df.head()

             Heroe Ciudad de residencia     Pasatiempo  Edad
0           Batman             New York  Ver peliculas     32
1        Spiderman         Las Brucelas     Ir al cine     54
2        Batichica          Los Angeles          Comer     34
3        Super Man                  USA         Bailar     45
4  Caballero Negro              Francia          Beber     34

In [47]:
# Muestra las primeras 10 filas del DataFrame. 
#Como solo hay 7 elementos, solo muestra los 7, pero si hubiera mas de 10, solo mostraria los 10 elementos

df.head(10)

             Heroe Ciudad de residencia      Pasatiempo  Edad
0           Batman             New York   Ver peliculas     32
1        Spiderman         Las Brucelas      Ir al cine     54
2        Batichica          Los Angeles           Comer     34
3        Super Man                  USA          Bailar     45
4  Caballero Negro              Francia           Beber     34
5          IronMan                 Peru       Juerguear     23
6          LadyBug                  USA      Enamorarse     23
7           Edriem                 Peru  Comer golosina      2

In [48]:
# Muestra las últimas 5 filas del DataFrame.
df.tail(5)

             Heroe Ciudad de residencia      Pasatiempo  Edad
3        Super Man                  USA          Bailar     45
4  Caballero Negro              Francia           Beber     34
5          IronMan                 Peru       Juerguear     23
6          LadyBug                  USA      Enamorarse     23
7           Edriem                 Peru  Comer golosina      2

# Tamaño del DataFrame

In [49]:
# Muestra el tamaño del DataFrame
df.shape

(8, 4)

# Data types en un DataFrame

In [50]:
# Muestra los data types del dataframe
df.dtypes

Heroe                   object
Ciudad de residencia    object
 Pasatiempo             object
Edad                     int64
dtype: object

# Editar el indice (index)

In [81]:
# Cambia el indice a la columna "Heroe".

df2 = df.set_index("Heroe")

In [82]:
df2.head()

                Ciudad de residencia     Pasatiempo  Edad
Heroe
Batman                      New York  Ver peliculas     32
Spiderman               Las Brucelas     Ir al cine     54
Batichica                Los Angeles          Comer     34
Super Man                        USA         Bailar     45
Caballero Negro              Francia          Beber     34

# Ordenar el indice

In [83]:
# Ordena el índice de forma descendiente
df_sorted = df.sort_values(by=["Heroe"], ascending=True)
df_sorted.head()

             Heroe Ciudad de residencia      Pasatiempo  Edad
2        Batichica          Los Angeles           Comer     34
0           Batman             New York   Ver peliculas     32
4  Caballero Negro              Francia           Beber     34
7           Edriem                 Peru  Comer golosina      2
5          IronMan                 Peru       Juerguear     23

# Resetear el indice

In [77]:
# Resetea el índice

df2 = df2.reset_index(drop=True)
df2.head()

  Ciudad de residencia     Pasatiempo  Edad
0             New York  Ver peliculas     32
1         Las Brucelas     Ir al cine     54
2          Los Angeles          Comer     34
3                  USA         Bailar     45
4              Francia          Beber     34